In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
r1 = np.arange(0, 18, 2)
r1

array([ 0,  2,  4,  6,  8, 10, 12, 14, 16])

In [4]:
ser = pd.Series(r1)
ser

0     0
1     2
2     4
3     6
4     8
5    10
6    12
7    14
8    16
dtype: int32

In [5]:
df = pd.DataFrame(r1.reshape(3, 3),columns=['A', 'B', 'C'])

In [6]:
df

    A   B   C
0   0   2   4
1   6   8  10
2  12  14  16

In [7]:
np.power(ser,2)

0      0
1      4
2     16
3     36
4     64
5    100
6    144
7    196
8    256
dtype: int32

In [8]:
np.add(df,2)

    A   B   C
0   2   4   6
1   8  10  12
2  14  16  18

In [9]:
np.sin(df*np.pi)

              A             B             C
0  0.000000e+00 -2.449294e-16 -4.898587e-16
1 -7.347881e-16 -9.797174e-16 -1.224647e-15
2 -1.469576e-15 -1.714506e-15 -1.959435e-15

In [10]:
pib = pd.Series({'État-Unis':18624.48,'Chine':11218.28,'Royaume-Uni':2647.9}, name='pib')

In [11]:
pibpop = pd.Series({'État-Unis':57638,'Japon':38972,'Chine':8117,'Allemagne':42232}, name='pib/habitant')

In [12]:
pib*100000000/pibpop

Allemagne               NaN
Chine          1.382072e+08
Japon                   NaN
Royaume-Uni             NaN
État-Unis      3.231285e+07
dtype: float64

In [13]:
r2 = np.arange(0, 20, 2)

In [14]:
df1 = pd.DataFrame(r2.reshape(5, 2),columns=['A','B'])
df1

    A   B
0   0   2
1   4   6
2   8  10
3  12  14
4  16  18

In [15]:
df2 = pd.DataFrame(r2.reshape(2, 5),columns=['A','B','C','D','E'])
df2

    A   B   C   D   E
0   0   2   4   6   8
1  10  12  14  16  18

In [16]:
df1 + df2

      A     B   C   D   E
0   0.0   4.0 NaN NaN NaN
1  14.0  18.0 NaN NaN NaN
2   NaN   NaN NaN NaN NaN
3   NaN   NaN NaN NaN NaN
4   NaN   NaN NaN NaN NaN

In [17]:
df3= df1.add(df2, fill_value=0)
df3

      A     B     C     D     E
0   0.0   4.0   4.0   6.0   8.0
1  14.0  18.0  14.0  16.0  18.0
2   8.0  10.0   NaN   NaN   NaN
3  12.0  14.0   NaN   NaN   NaN
4  16.0  18.0   NaN   NaN   NaN